{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true}}]}